# UseBalusterPerTreadOnStairs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPlacement..::..UseBalusterPerTreadOnStairs Property
BalusterPlacement Class See Also
---
If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool UseBalusterPerTreadOnStairs { get; set; }
```

Visual Basic
---
```text
Public Property UseBalusterPerTreadOnStairs As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseBalusterPerTreadOnStairs {
	bool get ();
	void set (bool value);
}
```

# See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace